c5/src/Documents/Payment/Payment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Payment</name>
  <basedOn>Document.Bill</basedOn>
  <basedOn>Document.Invoice</basedOn>
  <basedOn>Document.SalesOrder</basedOn>
  <registerRecords>AccumulationRegister.Discounts</registerRecords>
  <registerRecords>AccumulationRegister.DiscountDebts</registerRecords>
  <registerRecords>AccumulationRegister.SalesOrderDebts</registerRecords>
  <registerRecords>AccumulationRegister.Debts</registerRecords>
  <registerRecords>AccountingRegister.General</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceDebts</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>AdvanceAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Applied</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DocumentRef.Invoice</types>
      <types>DocumentRef.Bill</types>
      <types>DocumentRef.SalesOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>CashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractFactor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>Location</name>
    <type>
      <types>CatalogRef.PaymentLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Method</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceivablesVATAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>DefinedType.Reference</types>
    </type>
  </attributes>
  <attributes>
    <name>ReferenceDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>VATAdvance</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>Advance</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Bill</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Contract</name>
      <type>
        <types>CatalogRef.Contracts</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Debt</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Detail</name>
      <type>
        <types>DocumentRef.Payment</types>
        <types>DocumentRef.Invoice</types>
        <types>DocumentRef.Refund</types>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.Invoice</types>
        <types>DocumentRef.Bill</types>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.Refund</types>
        <types>DocumentRef.Debts</types>
      </type>
    </attributes>
    <attributes>
      <name>Option</name>
      <type>
        <types>CatalogRef.PaymentOptions</types>
      </type>
    </attributes>
    <attributes>
      <name>Overpayment</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Pay</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Payment</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentKey</name>
      <type>
        <types>CatalogRef.PaymentKeys</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Enums/PaymentMethods/PaymentMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PaymentMethods</name>
  <enumValues>
    <name>Cash</name>
  </enumValues>
  <enumValues>
    <name>Check</name>
  </enumValues>
  <enumValues>
    <name>Visa</name>
  </enumValues>
  <enumValues>
    <name>Mastercard</name>
  </enumValues>
  <enumValues>
    <name>AmericanExpress</name>
  </enumValues>
  <enumValues>
    <name>EFT</name>
  </enumValues>
  <enumValues>
    <name>Bank</name>
  </enumValues>
  <enumValues>
    <name>PayPal</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>ExpenseReport</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/Payment/Forms/Form/Module.bsl
&AtClient
var PaymentsRow export;

// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	PettyCash.Read ( ThisObject );
	InvoiceForm.SetLocalCurrency ( ThisObject );
	PaymentForm.ToggleDetails ( ThisObject );
	updateInfo ( ThisObject );
	Constraints.ShowAccess ( ThisObject );
	Appearance.Apply ( ThisObject );

EndProcedure

&AtClientAtServerNoContext
Procedure updateInfo ( Form )
	
	object = Form.Object;
	difference = object.Amount - object.Applied;
	if ( difference = 0 ) then
		Form.Info = "";
	else
		Form.Info = Output.CustomerPaymentDifference ( new Structure ( "Amount", Conversion.NumberToMoney ( difference, object.Currency ) ) );
	endif;
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		InvoiceForm.SetLocalCurrency ( ThisObject );
		DocumentForm.Init ( Object );
		if ( ThisObject.Parameters.Basis = undefined ) then
			PaymentForm.FillNew ( ThisObject );
			fillByCustomer ();
		else
			PaymentForm.Fill ( ThisObject );
		endif; 
		defineCopy ();
		updateInfo ( ThisObject );
		Constraints.ShowAccess ( ThisObject );
	endif; 
	PaymentForm.FilterAccount ( ThisObject );
	PaymentForm.SetTitle ( ThisObject );
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Base show filled ( Object.Base );
	|Customer Contract Company lock filled ( Object.Base );
	|BankAccount show Object.Method <> Enum.PaymentMethods.Cash;
	|Rate Factor enable Object.Currency <> LocalCurrency and Object.Currency <> Object.ContractCurrency;
	|ContractRate ContractFactor enable Object.ContractCurrency <> LocalCurrency;
	|NewReceipt show empty ( Receipt ) and Object.Method = Enum.PaymentMethods.Cash
	|	and not field ( Object.Location, ""Register"" );
	|Receipt FormReceipt show filled ( Receipt ) and Object.Method = Enum.PaymentMethods.Cash;
	|Reference ReferenceDate PaymentContent show Object.Method <> Enum.PaymentMethods.Cash;
	|Warning UndoPosting show Object.Posted;
	|Header GroupDocuments GroupCurrency GroupMore lock Object.Posted;
	|GroupFill MarkAll1 UnmarkAll1 enable not Object.Posted
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillByCustomer ()
	
	apply = Parameters.FillingValues.Property ( "Customer" )
	and Parameters.CopyingValue.IsEmpty () 
	and not Object.Customer.IsEmpty ();
	if ( apply ) then
		applyCustomer ();
	endif;
	
EndProcedure 

&AtServer
Procedure applyCustomer ()
	
	PaymentForm.SetOrganizationAccounts ( Object );
	PaymentForm.SetContract ( Object );
	applyContract ();
	
EndProcedure

&AtServer
Procedure applyContract ()
	
	PaymentForm.LoadContract ( Object );
	applyMethod ();
	PaymentForm.CalcContractAmount ( Object, 1 );
	PaymentForm.CalcAppliedAmount ( Object, 1 );
	PaymentForm.SetTitle ( ThisObject );
	refill ();
	updateInfo ( ThisObject );
	Appearance.Apply ( ThisObject, "Object.ContractCurrency" );
	Appearance.Apply ( ThisObject, "Object.Method" );
	
EndProcedure

&AtServer
Procedure applyMethod ()
	
	PaymentForm.SetBankAccount ( Object );
	applyBankAccount ();
	PaymentForm.FilterAccount ( ThisObject );
	Appearance.Apply ( ThisObject, "Object.Method" );
	
EndProcedure

&AtServer
Procedure applyBankAccount ()
	
	PaymentForm.SetAccount ( Object );
	PaymentForm.SetCurrency ( Object );
	applyCurrency ();
	
EndProcedure 

&AtServer
Procedure applyCurrency ()
	
	PaymentForm.SetRates ( Object );
	applyRate ( ThisObject );
	Appearance.Apply ( ThisObject, "Object.Currency" );
	
EndProcedure 

&AtClientAtServerNoContext
Procedure applyRate ( Form )
	
	object = Form.Object;
	PaymentForm.CalcContractAmount ( object, 1 );
	PaymentForm.CalcAppliedAmount ( object, 1 );
	PaymentForm.DistributeAmount ( object );
	updateInfo ( Form );
	
EndProcedure 

&AtServer
Procedure refill ()
	
	PaymentForm.Refill ( ThisObject );
	
EndProcedure 

&AtServer
Procedure defineCopy ()
	
	CopyOf = Parameters.CopyingValue;

EndProcedure

&AtClient
Procedure BeforeWrite ( Cancel, WriteParameters )
	
	StandardButtons.AdjustSaving ( ThisObject, WriteParameters );

EndProcedure

&AtServer
Procedure BeforeWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	passCopy ( CurrentObject );
	PaymentForm.Clean ( CurrentObject.Payments );	

EndProcedure

&AtServer
Procedure passCopy ( CurrentObject )
	
	if ( CurrentObject.IsNew () ) then
		CurrentObject.AdditionalProperties.Insert ( Enum.AdditionalPropertiesCopyOf (), CopyOf ); 
	endif;

EndProcedure

&AtServer
Procedure AfterWriteAtServer ( CurrentObject, WriteParameters )
	
	PettyCash.Read ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtClient
Procedure AfterWrite ( WriteParameters )
	
	Notify ( Enum.MessagePaymentIsSaved (), Object );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure CustomerOnChange ( Item )
	
	applyCustomer ();
	
EndProcedure

&AtClient
Procedure ContractOnChange ( Item )
	
	applyContract ();
	
EndProcedure

&AtClient
Procedure BankAccountOnChange ( Item )
	
	applyBankAccount ();
	
EndProcedure

&AtClient
Procedure LocationOnChange ( Item )
	
	applyLocation ();
	
EndProcedure

&AtServer
Procedure applyLocation ()
	
	PaymentForm.SetAccount ( Object );
	PaymentForm.FilterAccount ( ThisObject );
	Appearance.Apply ( ThisObject, "Object.Location" );
	
EndProcedure 

&AtClient
Procedure CurrencyOnChange ( Item )
	
	applyCurrency ();
	
EndProcedure

&AtClient
Procedure RateOnChange ( Item )
	
	applyRate ( ThisObject );
	
EndProcedure

&AtClient
Procedure FactorOnChange ( Item )
	
	applyRate ( ThisObject );
	
EndProcedure

&AtClient
Procedure ContractRateOnChange ( Item )
	
	PaymentForm.CalcPaymentAmount ( Object );
	updateInfo ( ThisObject );
	
EndProcedure

&AtClient
Procedure ContractFactorOnChange ( Item )
	
	PaymentForm.CalcPaymentAmount ( Object );
	updateInfo ( ThisObject );
	
EndProcedure

&AtClient
Procedure AmountOnChange ( Item )
	
	PaymentForm.CalcContractAmount ( Object, 1 );
	PaymentForm.CalcAppliedAmount ( Object, 1 );
	PaymentForm.DistributeAmount ( Object );
	updateInfo ( ThisObject );
	
EndProcedure

&AtClient
Procedure MethodOnChange ( Item )
	
	applyMethod ();
	
EndProcedure

&AtClient
Procedure NewReceipt ( Command )
	
	notifyNew = Object.Ref.IsEmpty ();
	createReceipt ();
	PettyCash.Open ( ThisObject, notifyNew );
	
EndProcedure

&AtServer
Procedure createReceipt ()
	
	PettyCash.NewReference ( ThisObject );
	Appearance.Apply ( ThisObject, "Receipt" );
	
EndProcedure 

&AtClient
Procedure ReceiptClick ( Item, StandardProcessing )
	
	PettyCash.ClickProcessing ( ThisObject, StandardProcessing );

EndProcedure

// *****************************************
// *********** Table Documents

&AtClient
Procedure FillPayments ( Command )
	
	Output.PaymentDataUpdateConfirmation ( ThisObject, true );

EndProcedure

&AtClient
Procedure PaymentDataUpdateConfirmation ( Answer, Refilling ) export
	
	if ( Answer = DialogReturnCode.No ) then
		return;
	endif;
	if ( Refilling ) then
		PaymentForm.CalcContractAmount ( Object, 1 );
		PaymentForm.CalcAppliedAmount ( Object, 1 );
		refill ();
	else
		update ();
	endif;
	updateInfo ( ThisObject );
	CurrentItem = Items.Payments;

EndProcedure

&AtServer
Procedure update ()
	
	PaymentForm.Update ( ThisObject );
	
EndProcedure

&AtClient
Procedure UpdatePayments ( Command )
	
	Output.PaymentDataUpdateConfirmation ( ThisObject, false );
	
EndProcedure

&AtClient
Procedure MarkAll ( Command )
	
	mark ( true );
	
EndProcedure

&AtClient
Procedure mark ( Flag ) 

	tempRow = PaymentsRow;
	for each row in Object.Payments do
		if ( row.Pay = Flag ) then
			continue;
		endif;
		row.Pay = Flag;
		PaymentsRow = row;
		PaymentForm.ApplyPay ( ThisObject );
		PaymentForm.CalcContractAmount ( Object, 2 );
		PaymentForm.CalcAppliedAmount ( Object, 2 );
	enddo;
	updateInfo ( ThisObject );
	PaymentsRow = tempRow;

EndProcedure

&AtClient
Procedure UnmarkAll ( Command )
	
	mark ( false );
	
EndProcedure

&AtClient
Procedure PaymentsOnActivateRow ( Item )
	
	PaymentsRow = Item.CurrentData;
	
EndProcedure

&AtClient
Procedure PaymentsOnEditEnd ( Item, NewRow, CancelEdit )
	
	if ( not CancelEdit ) then
		PaymentForm.TogglePay ( Item.CurrentData );
	endif;
	calcTotals ();

EndProcedure

&AtClient
Procedure calcTotals ()
	
	PaymentForm.CalcContractAmount ( Object, 2 );
	PaymentForm.CalcAppliedAmount ( Object, 2 );
	updateInfo ( ThisObject );
	
EndProcedure 

&AtClient
Procedure PaymentsBeforeAddRow ( Item, Cancel, Clone, Parent, Folder )
	
	Cancel = true;
	
EndProcedure

&AtClient
Procedure PaymentsAfterDeleteRow ( Item )
	
	calcTotals ();

EndProcedure

&AtClient
Procedure PaymentsSelection ( Item, SelectedRow, Field, StandardProcessing )
	
	StandardProcessing = not Item.CurrentItem.ReadOnly;
	PaymentForm.Show ( Item );
	
EndProcedure

&AtClient
Procedure PaymentsPayOnChange ( Item )
	
	PaymentForm.ApplyPay ( ThisObject );
	
EndProcedure

&AtClient
Procedure PaymentsDiscountRateOnChange ( Item )
	
	PaymentForm.CalcDiscount ( PaymentsRow );
	PaymentForm.CalcAmount ( PaymentsRow );
	PaymentForm.CalcOverpayment ( PaymentsRow );
	
EndProcedure

&AtClient
Procedure PaymentsDiscountOnChange ( Item )
	
	PaymentForm.CalcDiscountRate ( PaymentsRow );
	PaymentForm.CalcAmount ( PaymentsRow );
	PaymentForm.CalcOverpayment ( PaymentsRow );
	
EndProcedure

&AtClient
Procedure PaymentsAmountOnChange ( Item )
	
	PaymentForm.CalcOverpayment ( PaymentsRow );
	
EndProcedure
